app/controllers/api/v1/products_controller.rb

    def create
        @product = Product.new product_params
        if !@product.save
---
INSERT INTO "products" ("name", "amount", "value", "value_smash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "conjunto de toalhas"], ["amount", 50], ["value", 10.0], ["value_smash", 8.0], ["created_at", "2019-07-01 22:53:55.446969"], ["updated_at", "2019-07-01 22:53:55.446969"]]

    def index
        params[:page] ||= 1
        @products = Product.all.page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products"

    def index_app
        @products = Product.all
---
SELECT "products".* FROM "products"

    def update
        if !@product.update!(product_params)
---
UPDATE "products" SET "amount" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["amount", 503], ["updated_at", "2019-07-02 18:45:30.545709"], ["id", 1]]

    def destroy
        @product.delete
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]