app/controllers/api/v1/sales_controller.rb

INSERT INTO "sales" ("user_id", "address", "number", "complement", "reference", "phone", "cell_phone", "birthday_name", "year", "number_children", "age_range", "amount_adult", "hour", "date_event", "day_week", "date_final", "freight", "days_collect", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
INSERT INTO "sale_products" ("product_id", "sale_id", "created_at", "updated_at", "amount") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 1], ["sale_id", 11], ["created_at", "2019-07-02 00:28:44.056720"], ["updated_at", "2019-07-02 00:28:44.056720"], ["amount", 0]]
---
    def create
        @sale = Sale.new sale_params
        if @sale.save!
            @sale.create_sale_product(params)

SELECT COUNT(*) FROM "sales" INNER JOIN "users" ON "users"."id" = "sales"."user_id" WHERE (users.name ilike '%Ed%')
SELECT  "sales".* FROM "sales" INNER JOIN "users" ON "users"."id" = "sales"."user_id" WHERE (users.name ilike '%E%') LIMIT $1  [["LIMIT", 11]]
SELECT  "sales".* FROM "sales" INNER JOIN "users" ON "users"."id" = "sales"."user_id" LIMIT $1  [["LIMIT", 11]]
---
    def index
        params[:page] ||= 1
        if params[:field]
            @sales = Sale.joins(:user).where("users.name like '%#{params[:field]}%'").page(params[:page]).per(10)
        else
            @sales = Sale.joins(:user).page(params[:page]).per(10)

UPDATE "sales" SET "cell_phone" = $1, "updated_at" = $2 WHERE "sales"."id" = $3  [["cell_phone", "(31) 99429-4272"], ["updated_at", "2019-07-05 15:42:57.081965"], ["id", 20]]
INSERT INTO "sale_products" ("product_id", "sale_id", "created_at", "updated_at", "amount") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 1], ["sale_id", 20], ["created_at", "2019-07-05 16:05:11.141434"], ["updated_at", "2019-07-05 16:05:11.141434"], ["amount", 2]]
---
    def update
        if !@sale.update!(sale_params)
            render json: @sale.errors, status: :unprocessable_entity
        else
            @sale.create_sale_product(params)

DELETE FROM "sale_products" WHERE "sale_products"."id" = $1  [["id", 1]]
DELETE FROM "sales" WHERE "sales"."id" = $1  [["id", 11]]
---
    def destroy
        @sale.sale_products.destroy_all

SELECT  "sales".* FROM "sales" ORDER BY "sales"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def sale_html
        @sale = Sale.last
        table = ""
        @sale.sale_products.each do |sale_product|
            table = table + "<tr><td>#{sale_product.amount}</td><td>#{sale_product.product.name}</td><td>#{sale_product.product.value_smash}</td><td>#{sale_product.product.value}</td></tr>"

SELECT  "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def set_sale
        @sale = Sale.find(params[:id])