app/controllers/api/v1/sales_controller.rb

    def index
        params[:page] ||= 1
        @sales = Sale.all.page(params[:page]).per(10)
---
SELECT  "sales".* FROM "sales" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "sales"

    def set_sale
        @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]