app/controllers/api/v1/users_controller.rb

    def create
        @user = User.new user_params
        if !@user.save
---
INSERT INTO "users" ("name", "address", "number", "telephone", "cell_phone", "complement", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def index
        params[:page] ||= 1
        @users = User.all.page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users"

    def index_sale
        @users = User.all
---
SELECT "users".* FROM "users"

    def update
        if !@user.update!(user_params)
---
UPDATE "users" SET "number" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["number", 24861], ["updated_at", "2019-07-02 18:10:18.044458"], ["id", 2]]

    def destroy
        @user.delete
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]