app/models/sale.rb

SELECT "products".* FROM "products" WHERE (1)
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY "products"."id" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "amount" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["amount", 501], ["updated_at", "2019-07-05 16:05:11.106643"], ["id", 1]]
INSERT INTO "sale_products" ("product_id", "sale_id", "created_at", "updated_at", "amount") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 1], ["sale_id", 20], ["created_at", "2019-07-05 16:05:11.141434"], ["updated_at", "2019-07-05 16:05:11.141434"], ["amount", 2]]
UPDATE "sales" SET "value_final" = $1, "updated_at" = $2 WHERE "sales"."id" = $3  [["value_final", 20.0], ["updated_at", "2019-07-05 16:05:11.151781"], ["id", 20]]
---
    def create_sale_product params
        value_final = 0
        if params[:products]
            vet = params[:products]
            if vet
                vet.each do |product_sale|
                    product = Product.where(id: product_sale.split("||")[0])
                    if product.length > 0
                        product = product.last
                        value_final = (value_final+(product.value*product_sale.split("||")[1].to_f))*self.days_collect
                        product.update(amount: (product.amount-product_sale.split("||")[1].to_i))
                        self.sale_products.create(product_id: product.id, amount: product_sale.split("||")[1])
                    end
                end
                self.update(value_final: value_final)